Map posts = <String, dynamic>{
  'jalsdkfjslakde': {
    'user': 'اجمل جلال',
    'userLocation': 'کابل خیرخانه',
    'userPhoto':
        'https://cdn.pixabay.com/photo/2014/03/24/17/19/teacher-295387_1280.png',
    'postType': 'اعلان',
    'postTitle': 'قرجام',
    'postText':
        '  این برجام موجب لغو جامع کلیه تحریم های شورای امنیت سازمان ملل متحد و همچنین تحریم های چندجانبه و ملی مرتبط با برنامه هسته ای ایران و نیز شامل گام هایی برای ایجاد دسترسی در حوزه های تجارت، فناوری، مالی، و انرژی خواهد شد.',
    'postImages': [],
    'postLikes': 0,
    'postComments': {'1': 'a comment'},
    'postDate': DateTime.now(),
  },
  'jalsdksdfslakde': {
    'user': 'نقیب الله',
    'userLocation': 'کابل مکروریان سوم',
    'userPhoto':
        'https://cdn.pixabay.com/photo/2014/03/24/17/19/teacher-295387_1280.png',
    'postType': 'مفقودی',
    'postTitle': 'پاسپورت ګم شده',
    'postText':
        ' کمیسیون مشترکی متشکل از گروه ۱+۵ و ایران به منظور نظارت بر اجرای این برجام تشکیل خواهد شد و وظایف پیش بینی شده در این برجام را ایفا خواهد نمود. کمیسیون مشترک به موضوعات ناشی از اجرای این برجام رسیدگی نموده و مطابق با مفادی که در پیوست مربوطه شرح داده شده است، عمل خواهد کرد.',
    'postImages': [],
    'postLikes': 0,
    'postComments': {},
    'postDate': DateTime.now(),
  },
  'jaldfdffslakde': {
    'user': 'عبدالقیوم',
    'userLocation': 'کابل ارزان قیمت',
    'userPhoto':
        'https://cdn.pixabay.com/photo/2014/03/24/17/19/teacher-295387_1280.png',
    'postType': 'عادی',
    'postTitle': 'راه پلچرخی - ارزان قیمت بند است',
    'postText':
        'کلیه مفاد و اقدامات مندرج در این برجام صرفاً برای اجرای آن بین گروه ۱+۵ و ایران می باشد و نمی‏‌بایست به منزله‏ ایجاد رویه برای هیچ دولت دیگری، یا برای اصول بنیادین حقوق بین الملل و حقوق و تعهدات وفق معاهده‏ عدم اشاعه هسته ای و سایر اسناد مربوطه، و همچنین اصول و رویه‏‌ای شناخته‏ شده‏ بین المللی تلقی گردد.',
    'postImages': [],
    'postLikes': 0,
    'postComments': {},
    'postDate': DateTime.now(),
  },
  'jalsdkdsfeakde': {
    'user': 'عبدالوهاب',
    'userLocation': 'هرات ناحیه ۵',
    'userPhoto':
        'https://cdn.pixabay.com/photo/2014/03/24/17/19/teacher-295387_1280.png',
    'postType': 'عادی',
    'postTitle': 'پرواز به کابل بند است',
    'postText':
        'اتحادیه اروپایی، کشورهای گروه ۱+۵ و ایران در چارچوب این برجام، به نحو مقتضی در زمینه مصارف صلح آمیز انرژی هسته‏‌ای همکاری کرده و در طرح های مربوط به همکاری های هسته ای صلح آمیز که مشترکا توسط طرفین تعیین می شوند، از جمله از طریق مشارکت آژانس، تعامل خواهند نمود.',
    'postImages': [],
    'postLikes': 0,
    'postComments': {},
    'postDate': DateTime.now(),
  },
  'jalsewrtrefslae': {
    'user': 'مینا عالمی',
    'userLocation': 'کابل مکروریان ۴',
    'userPhoto':
        'https://cdn.pixabay.com/photo/2014/03/24/17/19/teacher-295387_1280.png',
    'postType': 'عادی',
    'postTitle': 'کانالیزاسیون خراب است',
    'postText':
        'کلیه مفاد و اقدامات مندرج در این برجام صرفاً برای اجرای آن بین گروه ۱+۵ و ایران می باشد و نمی‏‌بایست به منزله‏ ایجاد رویه برای هیچ دولت دیگری، یا برای اصول بنیادین حقوق بین الملل و حقوق و تعهدات وفق معاهده‏ عدم اشاعه هسته ای و سایر اسناد مربوطه، و همچنین اصول و رویه‏‌ای شناخته‏ شده‏ بین المللی تلقی گردد.',
    'postImages': [],
    'postLikes': 0,
    'postComments': {},
    'postDate': DateTime.now()
  },
  'dfdlsdkfdfakeg': {
    'user': 'اجمل جلال',
    'userLocation': 'کابل خیرخانه',
    'userPhoto':
        'https://cdn.pixabay.com/photo/2014/03/24/17/19/teacher-295387_1280.png',
    'postType': 'اعلان',
    'postTitle': 'قرجام',
    'postText':
        '  این برجام موجب لغو جامع کلیه تحریم های شورای امنیت سازمان ملل متحد و همچنین تحریم های چندجانبه و ملی مرتبط با برنامه هسته ای ایران و نیز شامل گام هایی برای ایجاد دسترسی در حوزه های تجارت، فناوری، مالی، و انرژی خواهد شد.',
    'postImages': [],
    'postLikes': 0,
    'postComments': {},
    'postDate': DateTime.now(),
  },
};
